from aiogram.utils.formatting import Bold, as_list, as_marked_section


categories = ['Акссесуары','Товары для дома']

description_for_info_pages = {
    "main": "Добро пожаловать!",
    "about": "Мы проверенны временем",
    "payment": as_marked_section(
        Bold("Варианты оплаты:"),
        "Картой в боте",
        "При получении карта/кеш",
        "В заведении",
        marker="✅ ",
    ).as_html(),
    "shipping": as_list(
        as_marked_section(
            Bold("Варианты доставки/заказа:"),
            "Курьер",
            "Самовынос (сейчас прибегу заберу)",
            marker="✅ ",
        ),
        as_marked_section(Bold("Нельзя:"), 
                          "Почта", 
                          "Голуби",
                           marker="❌ "
                             ),
        sep="\n----------------------\n",
    ).as_html(),
    'catalog': 'Категории:',
    'cart': 'В корзине ничего нет!',#если в корзине ничего не будет то используем этот баннер и это описание,а если есть то баннером будет фотка товара и подписью его описание
    'money':'Заработать денег!!',
    'inventory':'Выберите категории:',
    'inventory1':'Пуста!'#если в инвентаре ничего не будет то используем этот баннер и это описание,а если есть то баннером будет фотка товара и подписью его описание
}